-- phpMyAdmin SQL Dump
-- version 4.6.6deb5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Ноя 09 2019 г., 20:53
-- Версия сервера: 5.7.27-0ubuntu0.18.04.1
-- Версия PHP: 7.2.19-0ubuntu0.18.04.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `mybot`
--

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

CREATE TABLE `accounts` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `balance` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `accounts`
--

INSERT INTO `accounts` (`id`, `user_id`, `balance`) VALUES
(32, 798679229, 779),
(33, 842910015, 0),
(34, 193756024, 0),
(35, 589380590, 20892),
(36, 937331139, 0),
(37, 322004190, 232),
(38, 943602782, 0),
(39, 890741527, 0),
(40, 859056709, 0),
(41, 885237484, 0),
(42, 723523328, 0),
(43, 582064505, 0),
(44, 872115988, 0),
(45, 461806267, 12),
(46, 81638961, 0),
(47, 565103522, 0),
(48, 367087555, 8),
(49, 363422386, 0),
(50, 656200232, 0),
(51, 475445074, 0),
(52, 789034648, 0),
(53, 460106270, 0),
(54, 116997097, 219),
(55, 120784779, 0),
(56, 252388082, 0),
(57, 859642738, 0),
(58, 454614406, 0),
(59, 34299369, 0),
(60, 487283765, 0),
(61, 400995662, 0),
(62, 666549587, 165),
(63, 437540807, 119),
(64, 284089767, 0),
(65, 482890232, 0),
(66, 597664212, 0),
(67, 946495469, 0),
(68, 531155995, 0),
(69, 640211971, 0),
(70, 563630307, 0),
(71, 515196581, 0),
(72, 266141956, 0),
(73, 636341915, 0),
(74, 428688481, 0),
(75, 564299077, 0),
(76, 930909924, 0),
(77, 772968046, 0),
(78, 968770696, 0),
(79, 982174036, 0),
(80, 726767935, 0),
(81, 945708650, 28),
(82, 192363865, 0),
(83, 662354, 0),
(84, 452366387, 0),
(85, 429554803, 0),
(86, 614393213, 0),
(87, 882773856, 0),
(88, 562576786, 0),
(89, 912232993, 0),
(90, 679057536, 0),
(91, 831095916, 0),
(92, 316413680, 0),
(93, 857024216, 0),
(94, 874099693, 0),
(95, 712804261, 0),
(96, 712087032, 0),
(97, 923215203, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `contracts`
--

CREATE TABLE `contracts` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `cost` int(11) NOT NULL,
  `working` int(11) NOT NULL,
  `date_start` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `date_end` timestamp NULL DEFAULT NULL,
  `date_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `status` int(11) NOT NULL,
  `type` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `contracts`
--

INSERT INTO `contracts` (`id`, `user_id`, `cost`, `working`, `date_start`, `date_end`, `date_update`, `status`, `type`) VALUES
(18, 589380590, 60000, 18006, '2019-10-28 17:39:39', '2019-11-04 17:39:39', '2019-11-04 18:30:02', 2, 2),
(19, 322004190, 600, 182, '2019-10-28 18:18:29', '2019-11-04 18:18:29', '2019-11-05 21:27:36', 2, 2),
(21, 461806267, 150, 42, '2019-10-30 20:51:48', '2019-11-06 20:51:48', '2019-11-06 21:30:02', 2, 1),
(22, 367087555, 100, 28, '2019-10-30 22:28:15', '2019-11-06 22:28:15', '2019-11-06 23:30:01', 2, 1),
(23, 666549587, 1400, 420, '2019-10-31 06:49:13', '2019-11-07 06:49:13', '2019-11-07 07:30:01', 2, 1),
(24, 116997097, 1700, 511, '2019-10-31 09:52:09', '2019-11-07 09:52:09', '2019-11-07 11:00:02', 2, 1),
(25, 982174036, 1050, 315, '2019-11-01 07:30:05', '2019-11-08 07:30:05', '2019-11-08 09:30:01', 2, 1),
(26, 437540807, 400, 119, '2019-11-01 12:50:02', '2019-11-08 12:50:02', '2019-11-08 14:30:01', 2, 1),
(27, 589380590, 150, 12042, '2019-11-01 12:55:46', '2019-11-08 12:55:46', '2019-11-08 19:30:01', 2, 1),
(28, 945708650, 100, 28, '2019-11-01 16:50:28', '2019-11-08 16:50:28', '2019-11-08 18:00:02', 2, 1),
(29, 666549587, 120, 30, '2019-11-03 09:03:26', '2019-11-10 09:03:26', '2019-11-09 10:30:02', 1, 1),
(30, 798679229, 199, 54, '2019-11-03 10:14:28', '2019-11-10 10:14:28', '2019-11-09 11:00:01', 1, 1),
(31, 798679229, 100, 24, '2019-11-03 12:02:32', '2019-11-10 12:02:32', '2019-11-09 13:30:02', 1, 1),
(32, 666549587, 125, 20, '2019-11-05 07:42:14', '2019-11-12 07:42:14', '2019-11-09 09:00:03', 1, 1),
(33, 712804261, 100, 16, '2019-11-05 10:04:43', '2019-11-12 10:04:43', '2019-11-09 11:00:01', 1, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `deposit`
--

CREATE TABLE `deposit` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `cost` int(11) NOT NULL,
  `payment_system` varchar(255) NOT NULL,
  `comments` varchar(255) NOT NULL,
  `status` int(11) NOT NULL,
  `date_it` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `deposit`
--

INSERT INTO `deposit` (`id`, `user_id`, `cost`, `payment_system`, `comments`, `status`, `date_it`) VALUES
(7, 461806267, 100, 'Payeer', '#3u9f0g7w', 1, '2019-10-30 20:43:08'),
(9, 367087555, 100, 'Payeer', '#1e0a8t0n', 1, '2019-10-30 22:21:32'),
(11, 400995662, 5000, 'Payeer', '#6z4t6p5p', 0, '2019-10-31 05:18:21'),
(12, 666549587, 100, 'Payeer', '#1v3e4j6s', 0, '2019-10-31 05:59:32'),
(13, 666549587, 1300, 'Payeer', '#7s9j2r0d', 1, '2019-10-31 06:44:10'),
(15, 515196581, 1000, 'Payeer', '#3g7g3w7m', 0, '2019-10-31 11:24:28'),
(16, 772968046, 100, 'Payeer', '#3n4w0m7i', 0, '2019-10-31 11:40:05'),
(17, 589380590, 500, 'Payeer', '#6e5q1m5k', 0, '2019-10-31 11:58:42'),
(18, 968770696, 100, 'Payeer', '#2a4v0v8k', 0, '2019-11-01 04:29:17'),
(19, 968770696, 100, 'Payeer', '#5x7d0d9u', 0, '2019-11-01 04:29:43'),
(21, 982174036, 1000, 'Payeer', '#9c5u1l7o', 1, '2019-11-01 07:23:05'),
(22, 252388082, 5000, 'Payeer', '#2w5k5r8g', 0, '2019-11-01 11:22:21'),
(23, 437540807, 400, 'Payeer', '#6i5i9t0p', 1, '2019-11-01 12:25:31'),
(24, 945708650, 100, 'Payeer', '#5k6y6c9q', 0, '2019-11-01 16:30:00'),
(25, 945708650, 100, 'Payeer', '#2o5s6w7c', 0, '2019-11-01 16:39:30'),
(26, 945708650, 100, 'Payeer', '#2b9r0q9y', 1, '2019-11-01 16:44:28'),
(28, 614393213, 100, 'Payeer', '#3t8u4o4n', 0, '2019-11-03 09:02:11'),
(29, 461806267, 100, 'Payeer', '#4z1y8g0r', 0, '2019-11-03 17:58:43'),
(30, 712804261, 100, 'Payeer', '#4s1z3u6s', 0, '2019-11-04 20:34:58'),
(31, 712804261, 100, 'Payeer', '#2q3r0g6o', 0, '2019-11-04 20:49:23'),
(32, 712804261, 150, 'Payeer', '#3o6a5s1d', 0, '2019-11-04 22:25:08'),
(33, 859642738, 1000, 'Payeer', '#7g0y3v5t', 0, '2019-11-05 02:14:40'),
(34, 712804261, 100, 'Payeer', '#1t6t5p8w', 1, '2019-11-05 05:55:42'),
(35, 656200232, 100, 'Payeer', '#9y2p2j9j', 0, '2019-11-07 12:20:31');

-- --------------------------------------------------------

--
-- Структура таблицы `referals`
--

CREATE TABLE `referals` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `referal_id` int(11) NOT NULL,
  `earnings` int(11) NOT NULL,
  `date_it` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `referals`
--

INSERT INTO `referals` (`id`, `user_id`, `referal_id`, `earnings`, `date_it`) VALUES
(1, 116997097, 982174036, 100, '2019-11-01 06:34:12'),
(2, 116997097, 726767935, 0, '2019-11-01 10:31:23'),
(3, 461806267, 116997097, 170, '2019-11-01 12:32:06'),
(4, 461806267, 367087555, 10, '2019-11-01 12:42:52'),
(5, 367087555, 666549587, 140, '2019-11-01 12:53:13'),
(6, 367087555, 945708650, 10, '2019-11-01 16:25:33'),
(7, 428688481, 662354, 0, '2019-11-02 03:53:37'),
(8, 428688481, 452366387, 0, '2019-11-02 16:03:31'),
(9, 666549587, 429554803, 0, '2019-11-03 06:31:50'),
(10, 666549587, 614393213, 0, '2019-11-03 08:56:55'),
(11, 666549587, 882773856, 0, '2019-11-03 09:13:00'),
(12, 882773856, 562576786, 0, '2019-11-03 09:54:57'),
(13, 882773856, 912232993, 0, '2019-11-03 12:40:10'),
(14, 666549587, 679057536, 0, '2019-11-03 13:14:05'),
(15, 882773856, 831095916, 0, '2019-11-03 14:14:24'),
(16, 429554803, 316413680, 0, '2019-11-04 02:51:46'),
(17, 116997097, 857024216, 0, '2019-11-04 14:51:45'),
(18, 429554803, 874099693, 0, '2019-11-04 18:48:15'),
(19, 116997097, 712804261, 0, '2019-11-04 19:13:05'),
(20, 116997097, 712087032, 0, '2019-11-04 19:25:53'),
(21, 882773856, 923215203, 0, '2019-11-05 20:45:15');

-- --------------------------------------------------------

--
-- Структура таблицы `variables`
--

CREATE TABLE `variables` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `position` int(11) NOT NULL,
  `started` int(11) NOT NULL,
  `clicked` int(11) NOT NULL,
  `withdraw` int(11) NOT NULL,
  `cost` int(11) NOT NULL,
  `current_page` int(11) NOT NULL,
  `delete_message` int(11) NOT NULL,
  `message_id` int(11) NOT NULL,
  `buy_contract` int(11) NOT NULL,
  `deposit_sum` int(11) NOT NULL,
  `open_deposit` int(11) NOT NULL,
  `sum_payment` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `withdraw`
--

CREATE TABLE `withdraw` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `cost` int(11) NOT NULL,
  `payeer` varchar(255) CHARACTER SET utf8 NOT NULL,
  `status` int(11) NOT NULL,
  `date_it` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `withdraw`
--

INSERT INTO `withdraw` (`id`, `user_id`, `cost`, `payeer`, `status`, `date_it`) VALUES
(1, 367087555, 50, 'P1017243852', 1, '2019-10-30 22:44:19'),
(2, 116997097, 173, 'P1017579735', 1, '2019-11-01 10:37:08'),
(3, 666549587, 60, 'P1017213080', 1, '2019-11-01 10:49:33'),
(4, 367087555, 144, 'P1017243852', 1, '2019-11-01 12:58:41'),
(5, 461806267, 186, 'P1017532545', 1, '2019-11-01 14:20:18'),
(6, 367087555, 10, 'P1017243852', 1, '2019-11-01 18:24:16'),
(8, 116997097, 219, 'P1017579735', 0, '2019-11-05 08:54:38'),
(9, 367087555, 16, 'P1017243852', 0, '2019-11-05 09:03:39'),
(10, 461806267, 24, 'P1017532545', 0, '2019-11-05 09:09:10'),
(11, 712804261, 4, 'P1017259565', 0, '2019-11-06 14:02:32'),
(12, 982174036, 270, 'P1017630132', 0, '2019-11-07 15:12:35'),
(13, 982174036, 45, 'P1017630132', 0, '2019-11-08 13:52:48'),
(14, 712804261, 12, 'P1017259565', 0, '2019-11-09 18:57:31');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `accounts`
--
ALTER TABLE `accounts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `contracts`
--
ALTER TABLE `contracts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `deposit`
--
ALTER TABLE `deposit`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `referals`
--
ALTER TABLE `referals`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `variables`
--
ALTER TABLE `variables`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `withdraw`
--
ALTER TABLE `withdraw`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `accounts`
--
ALTER TABLE `accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=98;
--
-- AUTO_INCREMENT для таблицы `contracts`
--
ALTER TABLE `contracts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;
--
-- AUTO_INCREMENT для таблицы `deposit`
--
ALTER TABLE `deposit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;
--
-- AUTO_INCREMENT для таблицы `referals`
--
ALTER TABLE `referals`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
--
-- AUTO_INCREMENT для таблицы `variables`
--
ALTER TABLE `variables`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `withdraw`
--
ALTER TABLE `withdraw`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
